InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КатегорииРасходовНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>КатегорииРасходовНаПерсонал</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеОсмотры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопускиКРаботам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УвольнениеИзОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УвольнениеИзОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы</xr:Item>
				<xr:Item>InformationRegister.ПериодыРаботыРаботниковОрганизацийПоСовместительству</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеШтатныеЕдиницыОрганизаций</xr:Item>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяТКРФ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеУвольнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрекращатьСтандартныеВычеты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакКомпенсацииОтпуска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРасчетаОтпуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокРасчетаОтпуска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейЧасовКомпенсацииУдержанияОтпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриказа</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриказа</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Увольнение</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.РезультатИспытательногоСрока</xr:Item>
				<xr:Item>Document.УвольнениеИзОрганизаций</xr:Item>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботников</xr:Item>
				<xr:Item>InformationRegister.Работники</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеРабочиеМеста</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботников</xr:Item>
				<xr:Item>InformationRegister.ПериодыРаботыРаботников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаУвольнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/УченическиеДоговорыСервер/Ext/Module.bsl
// Функция выполняет запрос для получения погашаемых при увольнении 
//  обязательств по ученическим договорам
//
Функция СформироватьЗапросПоОбязательствам(ДокументУвольнениеСсылка) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УвольнениеРаботники.ДатаУвольнения КАК Период,
	|	УвольнениеРаботники.Сотрудник,
	|	УвольнениеРаботники.Физлицо КАК Физлицо,
	|	ОбязательстваРаботниковПоУченическимДоговорам.Организация КАК Организация,
	|	ОбязательстваРаботниковПоУченическимДоговорам.Договор,
	|	ОбязательстваРаботниковПоУченическимДоговорам.Мероприятие КАК Мероприятие,
	|	ОбязательстваРаботниковПоУченическимДоговорам.ДатаНачала КАК ДатаНачала,
	|	ОбязательстваРаботниковПоУченическимДоговорам.ДатаОкончания КАК ДатаОкончания,
	|	МИНИМУМ(УченическийДоговорПериодыОбязательств.ДатаОкончанияОбязательства) КАК ДатаОкончанияОбязательства,
	|	УченическийДоговорПериодыОбязательств.Валюта
	|ПОМЕСТИТЬ Обязательства
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеРаботники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ОбязательстваРаботниковПоУченическимДоговорам.Период) КАК Период,
	|			УвольнениеРаботники.Физлицо КАК Физлицо,
	|			ОбязательстваРаботниковПоУченическимДоговорам.Договор КАК Договор,
	|			КОЛИЧЕСТВО(СотрудникиОрганизаций.Ссылка) КАК Количество
	|		ИЗ
	|			Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеРаботники
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбязательстваРаботниковПоУченическимДоговорам КАК ОбязательстваРаботниковПоУченическимДоговорам
	|				ПО УвольнениеРаботники.Физлицо = ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо
	|					И УвольнениеРаботники.ДатаУвольнения >= ОбязательстваРаботниковПоУченическимДоговорам.Период
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|				ПО УвольнениеРаботники.Физлицо = СотрудникиОрганизаций.Физлицо
	|					И (СотрудникиОрганизаций.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)))
	|					И (ВЫБОР
	|						КОГДА УвольнениеРаботники.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
	|							ТОГДА УвольнениеРаботники.Сотрудник.ВидЗанятости = СотрудникиОрганизаций.ВидЗанятости
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ)
	|					И (СотрудникиОрганизаций.ДатаУвольнения >= УвольнениеРаботники.ДатаУвольнения
	|						ИЛИ СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|		ГДЕ
	|			ОбязательстваРаботниковПоУченическимДоговорам.СпособПогашения = ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияОбязательствПоУченическомуДоговору.ПриУвольнении)
	|			И (НЕ ОбязательстваРаботниковПоУченическимДоговорам.Регистратор = &Регистратор)
	|			И УвольнениеРаботники.Ссылка = &Регистратор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УвольнениеРаботники.Физлицо,
	|			ОбязательстваРаботниковПоУченическимДоговорам.Договор) КАК Сотрудники
	|		ПО УвольнениеРаботники.Физлицо = Сотрудники.Физлицо
	|			И (Сотрудники.Количество = 1
	|				ИЛИ &ВестиОбучениеРазвитиеПоЦентрамОтветственности)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбязательстваРаботниковПоУченическимДоговорам КАК ОбязательстваРаботниковПоУченическимДоговорам
	|		ПО УвольнениеРаботники.Физлицо = ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо
	|			И (Сотрудники.Период = ОбязательстваРаботниковПоУченическимДоговорам.Период)
	|			И (Сотрудники.Договор = ОбязательстваРаботниковПоУченическимДоговорам.Договор)
	|			И ((НЕ ОбязательстваРаботниковПоУченическимДоговорам.Погашено))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УченическийДоговор.ПериодыОбязательств КАК УченическийДоговорПериодыОбязательств
	|		ПО (Сотрудники.Договор = УченическийДоговорПериодыОбязательств.Ссылка)
	|			И УвольнениеРаботники.Физлицо = УченическийДоговорПериодыОбязательств.ФизЛицо
	|			И (УченическийДоговорПериодыОбязательств.ДатаОкончанияОбязательства >= УвольнениеРаботники.ДатаУвольнения)
	|ГДЕ
	|	УвольнениеРаботники.Ссылка = &Регистратор
	|	И (НЕ УвольнениеРаботники.Сторно)
	|
	|СГРУППИРОВАТЬ ПО
	|	УвольнениеРаботники.ДатаУвольнения,
	|	УвольнениеРаботники.Сотрудник,
	|	УвольнениеРаботники.Физлицо,
	|	ОбязательстваРаботниковПоУченическимДоговорам.Организация,
	|	ОбязательстваРаботниковПоУченическимДоговорам.Договор,
	|	ОбязательстваРаботниковПоУченическимДоговорам.Мероприятие,
	|	ОбязательстваРаботниковПоУченическимДоговорам.ДатаНачала,
	|	ОбязательстваРаботниковПоУченическимДоговорам.ДатаОкончания,
	|	УченическийДоговорПериодыОбязательств.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбязательстваРаботниковПоУченическимДоговорам.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалют.Валюта,
	|	КурсыВалют.Курс,
	|	КурсыВалют.Кратность,
	|	ДатыВалюты.ДатаВалюты,
	|	ДатыВалюты.ДатаОкончанияОбязательства
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	(ВЫБРАТЬ
	|		Валюты.Ссылка КАК Валюта,
	|		Обязательства.ДатаОкончанияОбязательства КАК ДатаОкончанияОбязательства,
	|		МАКСИМУМ(КурсыВалют.Период) КАК ДатаВалюты
	|	ИЗ
	|		Обязательства КАК Обязательства
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО Обязательства.ДатаОкончанияОбязательства >= КурсыВалют.Период
	|				И (Валюты.Ссылка = КурсыВалют.Валюта)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Валюты.Ссылка,
	|		Обязательства.ДатаОкончанияОбязательства) КАК ДатыВалюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДатыВалюты.Валюта = КурсыВалют.Валюта
	|			И ДатыВалюты.ДатаВалюты = КурсыВалют.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КурсыВалют.Валюта,
	|	ДатыВалюты.ДатаОкончанияОбязательства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обязательства.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ВестиОбучениеРазвитиеПоЦентрамОтветственности
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		ИНАЧЕ Обязательства.Организация
	|	КОНЕЦ КАК Организация,
	|	Обязательства.Сотрудник КАК Сотрудник,
	|	Обязательства.Физлицо КАК Физлицо,
	|	Обязательства.Договор КАК Договор,
	|	ИСТИНА КАК Погашено,
	|	Обязательства.Мероприятие КАК Мероприятие,
	|	Обязательства.ДатаНачала КАК ДатаНачала,
	|	Обязательства.ДатаОкончания КАК ДатаОкончания,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияОбязательствПоУченическомуДоговору.ПриУвольнении) КАК СпособПогашения,
	|	ЕСТЬNULL(УченическийДоговорПериодыОбязательств.Сумма * (КурсыВалют.Курс / КурсыВалют.Кратность) / (КурсВалютыУпрУчета.Курс / КурсВалютыУпрУчета.Кратность), 0) КАК Сумма,
	|	УченическийДоговорПериодыОбязательств.ДатаОкончанияОбязательства КАК ДатаОкончанияОбязательства,
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииРасходовНаПерсонал.Обучение) КАК КатегорияРасходов
	|ИЗ
	|	Обязательства КАК Обязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УченическийДоговор.ПериодыОбязательств КАК УченическийДоговорПериодыОбязательств
	|		ПО Обязательства.Договор = УченическийДоговорПериодыОбязательств.Ссылка
	|			И Обязательства.Физлицо = УченическийДоговорПериодыОбязательств.ФизЛицо
	|			И Обязательства.ДатаОкончанияОбязательства = УченическийДоговорПериодыОбязательств.ДатаОкончанияОбязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО Обязательства.Валюта = КурсыВалют.Валюта
	|			И Обязательства.ДатаОкончанияОбязательства = КурсыВалют.ДатаОкончанияОбязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыУпрУчета
	|		ПО (Константы.ВалютаУправленческогоУчета = КурсВалютыУпрУчета.Валюта)
	|			И Обязательства.ДатаОкончанияОбязательства = КурсВалютыУпрУчета.ДатаОкончанияОбязательства";
	
	Если ПолучитьФункциональнуюОпцию("ВестиОбучениеРазвитиеПоЦентрамОтветственности") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.УвольнениеИзОрганизаций.РаботникиОрганизации", "Документ.Увольнение.Работники");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (НЕ УвольнениеРаботники.Сторно)", "");
	КонецЕсли; 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", ДокументУвольнениеСсылка);
	Запрос.УстановитьПараметр("ВестиОбучениеРазвитиеПоЦентрамОтветственности", ПолучитьФункциональнуюОпцию("ВестиОбучениеРазвитиеПоЦентрамОтветственности"));
	
	УстановитьПривилегированныйРежим(Истина);

	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОбязательствам
